packages/django-jbank/django-jbank-3.8.6.tar.gz/django-jbank-3.8.6/logs/ws/00000048a.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:pkif="http://danskebank.dk/PKI/PKIFactoryService" xmlns:elem="http://danskebank.dk/PKI/PKIFactoryService/elements">
  <soapenv:Header/>
  <soapenv:Body>
    <pkif:CreateCertificateIn>
      <pkif:RequestHeader>
        <pkif:SenderId>6D3142</pkif:SenderId>
        <pkif:CustomerId>6D3142</pkif:CustomerId>
        <pkif:RequestId>48</pkif:RequestId>
        <pkif:Timestamp>2020-07-20T23:49:13.235618+03:00</pkif:Timestamp>
        <pkif:InterfaceVersion>1</pkif:InterfaceVersion>
        <pkif:Environment>customertest</pkif:Environment>
      </pkif:RequestHeader>
    <EncryptedData xmlns="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Element">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<EncryptedKey xmlns="http://www.w3.org/2001/04/xmlenc#">
<EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/>
<KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#">
<X509Data>
<X509Certificate>MIIFATCCAumgAwIBAgIFAQjv8bkwDQYJKoZIhvcNAQELBQAwgZgxEDAOBgNVBAMT
B0RCR1JPT1QxCzAJBgNVBAYTAkRLMRMwEQYDVQQHEwpDb3BlbmhhZ2VuMRAwDgYD
VQQIEwdEZW5tYXJrMRowGAYDVQQKExFEYW5za2UgQmFuayBHcm91cDEaMBgGA1UE
CxMRRGFuc2tlIEJhbmsgR3JvdXAxGDAWBgNVBAUTDzYxMTI2MjI4MTExMDAwMzAe
Fw0yMDAyMDQxMjAwMDBaFw0yMjAyMDQxMjAwMDBaMIGYMRAwDgYDVQQDEwdEUENS
WVBUMQswCQYDVQQGEwJESzETMBEGA1UEBxMKQ29wZW5oYWdlbjEQMA4GA1UECBMH
RGVubWFyazEaMBgGA1UEChMRRGFuc2tlIEJhbmsgR3JvdXAxGjAYBgNVBAsTEURh
bnNrZSBCYW5rIEdyb3VwMRgwFgYDVQQFEw82MTEyNjIyODQ5MTAwMDkwggEgMA0G
CSqGSIb3DQEBAQUAA4IBDQAwggEIAoIBAQCmSUzQYj0Fx3jwvkz0lhmyyXRKwo5T
hts+1xFrG7euQ6oIMUJJpr8tgKxwDxdxxK/RXaYCHRH9mpIoyxCPlS3reRF4BMB6
gL2KOINnRyC3jmJ7kYHyWdhYfMb5VPIvusqPXc91HdVJb6rxvVSrTy/dB+V1od2q
uHNxA+Luhno37CXU1STrVvSrgHzOm45MROryuOu0lWY+d49tWZN9ilNI2Rf8mJjT
ZVKwJu4v02jXLGAqWpXQX0vxa7nI1D0xkOqnTvd04iDOdDE+jRtiy3SF8508LRqQ
jRH+9TZbX++yFd9Z/AR2h6AwM8OsLSC1QMJG7KeJw8st7K9i8KEOdglpAgEDo1Iw
UDAfBgNVHSMEGDAWgBTrVX/FmGlwJqoQ3fgyj1cJ40A/OjAdBgNVHQ4EFgQUMowN
BX+7Vy5lfO+d+tCxZ+ZupdYwDgYDVR0PAQH/BAQDAgQwMA0GCSqGSIb3DQEBCwUA
A4ICAQA+TV7cAPm5mKIAzTfuS4x4/KAlysTXZ3o0F2fYZmylNnUafi0+T21utPAv
bBYVFpr9fRq+q0L75ZCqU4pDvRLpHF7Q0RZ01ra7otVS78saxc/YUql+MsnHxeUw
9F8FJx7234KlRkhmY8xB743T/LQcp3zCRYUd0Rn2Ocaq7YoYGnx8QALItmJcagsX
MwYVsvXtWHHaDGFpcaivLX3e8cVQ+nI7slq1EfJ5xEdtSZ/zcGv+Ve4S6D1HLQ/K
oTQMzematrVvwwJMuqLMQdA1Pdtau3niupB3Se7AUq0bEZYF04Zlo4sOE21K9gSt
lJ5tSq0ohli02uXuQ/ggsqZSIH4t9WirWOMpS4KFkub02AYaicbm6SUyVg+odEaj
cFz+TEqd9C7cGgBL6MkLxXGj0DX64z4yU9lMlqQ8CzuZi5cMfpxvHVm4E+etLnYf
fzZ6jPnf3RbVumxPaRqnz6vceijWtmESg6cBei+phPzMCjjrXP0xng3+Bzqdn/lY
e8znS54o+UWJcENwvGc6tsUtBYGJOe6srIJHrXQKTG3DN6oDN2U5zT4cUBFvlHjx
fdj14m0Y0+gE90iTUJknWVRyyNDhPbYG1YCHRItVUxpGIp9tsV5FRP5qVbiMC7ba
hEsDAxMvL29i1vJbnJPT9e4OPkhEN5IqVQbu0QeOKMYT/YMZZQ==</X509Certificate>
</X509Data>
</KeyInfo>
<CipherData>
<CipherValue>g9oNqO5cXku7zT3CR/ujSwuFZvmwnnZl1qR6Nhd+ncDwu0mjpaTrLoTDVa9wngmG
94LVfm0OJsLiVOn6VYAI4SZblxCtqJaJjv6NDPJzhUEwhbeHqkDRjYRVJR0rwqrI
oQ6TkqH33nYR3NF/jZauxFwW5eb8rDDMHY8aRwMqbWGDc1o1PmTkd4YKQSD2ZT6u
BdfRd72iPbxEUoN+Uwk/H7Jt4ZlgBS2Ms7ZfuqpQq0+95BHjEuyKVVFuf2xiAkol
rgVlKhhHhmge94lDYbRZeB7r2xLc5iyuOQ3bbem0/eAOOyina4KNLLkXxI0UoSN5
1YVy7pz5qQMbbpgVjKYHQw==</CipherValue>
</CipherData>
</EncryptedKey>
</KeyInfo>
<CipherData>
<CipherValue>kKV80OHyi4nkOKmLZEGJPQ25Pnyc57xnbTY97peILre8msmElwDA/QpBkSjAaEsj
YUjRvE0a9Oe6Ii1oGKcpjPyc0ge/XkAbVcW/O4RDBuj+23OpI4UqWPPOQJzV0Zf2
vqyHYFtTu1tB01Smd7RXuik2kKBgqBQZp6V0eZ2GA0IKEzqD6exc6bOvPe0PSf2M
aP9FbS7I5YqpqpbhAkArOpmkP/8TmbP/afrt+zhAFEzvF5Stj+dt6XFUmoseYR4o
sqTeuGr3tb+PMcX1/XRTo+TRxrArweRWqBwIJ2k8/Gx6oSwDp8ReltmYxPjv+tVk
zQ4yvAJfU5GVB0cuLwpFBqsdJJLwzUmTe0ge3zTCkLnVjm1QNqD9E66CHQuB/GUS
D2pXXW73UoODfuNit3RyaqdMIiHu5dqFMXHXLZoUVTsacUWHphlfgkbFoVcVrxrd
vtOWlM1HilHZla0FLxT/PtsRPvSu5qkZWEEu6WrkFnlxFOYYhnAbH60XQTv4Bu5j
DAgVBU3DFP7nm+wu2vbM5xsg6ARA9Vw7xuOHjGRADp+2/H9n973UUB8LZUyCDDqG
7Gam+Azn9hdOkCqTmfarv9flYPXsRHmWEkwWr68CNfiGvl4HrH4zVno6PY081OQu
Xxhq2F4yEk0qexVMAKLtkfOEBLtRTw1grlqKXYhS35hsHOKePEIhi4XopzaNvxsj
qOpADA98M2qaaYFfRvODxTfqM9ZZ59MlEqbWK1900dLu/6+XmHVt/mfYM90A6Uuv
gOLtzRygJDI32bBRyyoaKc4bE8XHXDOQ0HuSLxKy6FcuuPYagjpAeaaEO8G8lVfZ
9QceMRu37IDz8lvKZOVB8iVmu2JlK1+dcwrNwIUgTocMw404w1n1I0sUn8wT7wJb
reXpTafciGb3kkkq2Fnqqffh/G3Nf+pnkkYZLc3IzKhMwB1qei2ws9oQzfHsa1Xu
o3Mb9ZjEcFrii6rlhyxDewFURaDR5t1jwsvmBSc9ZGrLXRUQCeD+wpQqp3J8wnoM
5qnB5KAZZbyLDyMRbRVgGsLK+4wL9fZK8YV3dp+cw9bgsdvMUjIY4FaJ/plhIu1R
OXWYkVyxaYCfW4YwFBOBE7I5of+rfOuFuDRFHSu+Py6R24pt/hjWjLaqnHDxkJSw
r6h0lkxHJSPUk92iNS7/B/Dc9q3IPhQJBUyglk8m64ibOMscMB9S/IogCO4dQOUw
Z+kCY9L0DYuHrag4SQiHw45G/LLtj1e5qwVYS1Fq1GRlTIKFu5TyLBfFwlmruYUG
7uJzFJ2U/BVwTuXz9bQeThSErv7XisTpSsFRfA6s4s0HoyZKdpKr95YOizgQA8W4
Dpi4hhWPFcT6aoZXDG9kScvJw/yV0jX5EHAwwvsvYioUCOsWSwX19cvgNeSgkvLr
1cvQOcnc0pJd37Yiil9ngs1PW3zy3CsKQRByDJHxO1xE98rXqwy2gUhZH//Sdev2
lZk+Fu8okRZqyyFCSYwRiLR/j04l/wnBFMQWpgjkBfRkpO8rfdLCbOZ5fdOKayXB
yVtIhWJy+g9Nwn48t0IUu9KpMVJd2Z7eruCpzS6KpEBxNFhWgEmUpPvLPpE/LRHA
6iWELNQyOtg7uVbCwFcDxnmIjwxIS2TFZgsuM0M05aqfHiNE7N0vvRi8DslXlJ2l
DRR1F9DGF0/xuSWH6mDt1cVg71nFn/WoBdu2jIn2q4t1u/+KDKAk1NpEv55JhLDd
4S4WZ51xGdmkAge0oMvht732K/92++qDNNCGs2zh9Ljf09K9KV7qLKfwSbBz46zk
5JYar0EhOkWghBhdFLSLEhPlg+5HQJmC7cYeGqQa05/Odx3otvJ8EBM+r5oGHu4s
ZrEr6Zi7TtQdh+Hdore4tvW8DfXbZ6PPsRbOKiN6ZnojqzIVq/dMt+FSeHIzQ73p
4ztzZGNsI9V+jwxzlDAki84YGeEefn4F7bZWC2+1/HHjh6UNX2mdDdBrpzod/3Q9
7KG9cQzXATngSuV8oEpvj3aT3RN7xXdhl/4CgZH5NF8WgkW6BMMauA04+2pQXqep
h6TEq2gxR+Zlg0yU6AQ5zqDRjCU7t437fF4C/6xvi+SmvEsiZIJCqh+aOZEBlqkP
wc+Smf5Tx/mlUrqGnLQXY63z7GOGwxRrBAi/R6rUxaZNMLRvQLzUahB01zccFZjM
AXGS1YkAjVvVhtctb/BYfU+OYki2huTMZgRh0jrxovpyP7Cq9lDo492RHdgyLl2g
NPzmuSXonN9Azx2ByTgwggb4o9TQGNpkRhkpr6guSPrH709+i7WYaSEhl2FFezrY
OAFSI7yeHMZV7mye84ZVn8f0iYTE9qdayFfU7BDU0NFyTDFu8mAxJmhzQFDdLoTo
Zd6GoZkbWch6lDU2/5U1+fZGK1/qTfJ3FKWa+pCiUvc/uzZe680YxO8oEfXvPQ0t
nPRTs9tsp5+7hmpyTPsdkiVvqw4R/xcQqZ6FXiObNixpsorvxu9YyAhust8cvZMp
hb8BjDEV46zXEEom3TzyH5PhVt39i1Mr2V6PQLrFLoTLva19QGEIXhoSS61HjsRu
stT1jY/r729m1o5R0qS/v15ohEEjdb1trGrhjln/pp2L2Lno31OqyglgCtuwtnkZ
kywxnbtGQuErH8HCJB2w7TrbHH6c8G++UOACVRo1WZ+6BLGMD1vGTKIKc9LbLLog
CsW8A4+EvxAYO9v/Yykrp2a2guC3/JGUYerFG1O/xrinnpNVpEY7BGIxu76whLRu
3AzOmO5ICOuf83lo9DfqsbJP1vJ3tLENU+PUXYJ/5xWMlLyq8w8iK9WrcVR0EEQH
MFlFLT38UjHpfuCjSlrJltYccHAkGOrmVKBdebavaNd5vDOdeXgh4+vcUE+OOrlV
e5TfHntmv3p2ZSXih26p9WoQhbASIuICRtArIOVRHi2N301Tv3v6Z7oo96NQ7JzM
OMmjRSQKBuZapbTCkl0euqpss00xYunZD+z74tHUsF9MblPfkgcx3zLhaR0qERsJ
RhLT5VGALgn0+611lwSuojkuhLcRIjXJIE0XNbQ5tzWas0D/tXgjKFSCvxVtuq6P
xtySD6UYPBTUt150PpzLsX92DL9LJehTz8YraR/uJ2bnbUgaQJDQ6Q7CYN3gCrGw
WnKkyLaAPeCIo2unfUJjGpXL5pKDPLaTVBi/jYwlGzqQfzkbX0IUkOlNUCDKeEUJ
+D4y0kw004mGGe9kpX7f9vzxL7OI47k+2+NmJwYODVp+3i2jpERQwRBBasgwU2dT
D18liDcnULRHzQUmi7C6w0wyv9QQOekdGQMNPbvyjyTT0pDBZxwJgqvs1K7oiz8s
Z+IaTQFjsnua0osXJqNZ3ofmMjsj2yJf7bKvGDBBDu2ejwxDb4PSpxPSCXOHQchX
b3WcCJVGbJPUtmogNSBHEWGdgbJZlP3EsNYc5vwgBlSg8drfHszXSlE2JAI3bWIo
HlmfMaWAUElVMO4uNOfnBGLivd/mTCj7HAnctkYoV9xoJ3X9AqNdtgsX+hncjESV
2WaRcHcIk/Uhy38wBTVtbNWHJty8ciRwi/RoTZr8wD/D6BpwJMiaeovVtpf/sEjj
EUTd3oplseIImDGdgLcYd60PzmbFRnzIWkDPNFfOCXxWqbUnaHX9LwQXkYFuQ7YP</CipherValue>
</CipherData>
</EncryptedData></pkif:CreateCertificateIn>
  </soapenv:Body>
</soapenv:Envelope>